[TankWOTC X2SoldierClassTemplate]
+DisplayName="坦克"
+ClassSummary="坦克因他们在战场上的高存活率而闻名。因为他们超强的耐力，他们能够承受很强的攻击。"
+LeftAbilityTreeTitle="生存"
+RightAbilityTreeTitle="战斗"
+AbilityTreeTitles[0]="生存"
+AbilityTreeTitles[1]="战斗"
+AbilityTreeTitles[2]="Special"
+AbilityTreeTitles[3]="XCOM"

;nicknames that fit in the role of a tank
+RandomNickNames[0]=“山”
+RandomNickNames[1]=“珠穆朗玛峰”
+RandomNickNames[2]=“天顶”
+RandomNickNames[3]=“冰山”
+RandomNickNames[4]=“冰川”
+RandomNickNames[5]=“峰会”
+RandomNickNames[6]=“幸存者”
+RandomNickNames[7]=“表情”
+RandomNickNames[8]=“石头”
+RandomNickNames[9]=“墙”
+RandomNickNames[10]=“铁”
+RandomNickNames[11]=“钢”
+RandomNickNames[12]=“拳头”
+RandomNickNames[13]=“坚果”
+RandomNickNames[14]=“要塞”
+RandomNickNames[15]=“地堡”
+RandomNickNames[16]=“盾牌”
+RandomNickNames[17]=“摇滚”
+RandomNickNames[18]=“博尔特”
+RandomNickNames[19]=“高尔夫球”
+RandomNickNames[20]=“冰箱”
+RandomNickNames[21]=“椰子”
+RandomNickNames[22]=“锤子”
+RandomNickNames[23]=“保龄球”
+RandomNickNames[24]=“台球”
+RandomNickNames[25]=“地壳”
+RandomNickNames[26]=“傀儡”
+RandomNickNames[27]=“飓风”
+RandomNickNames[28]=“垃圾场”
+RandomNickNames[29]=“审判者”
+RandomNickNames[30]=“淘汰赛”
+RandomNickNames[31]=“金刚”
+RandomNickNames[32]=“疯狂狗”
+RandomNickNames[33]=“崩溃”
+RandomNickNames[34]=“驼鹿”
+RandomNickNames[35]=“新星”
+RandomNickNames[36]=“硝基”
+RandomNickNames[37]=“核武器”
+RandomNickNames[38]=“食人魔”
+RandomNickNames[39]=“比特犬”
+RandomNickNames[40]=“火焰兵”
+RandomNickNames[41]=“红线”
+RandomNickNames[42]=“犀牛”
+RandomNickNames[43]=“火箭”
+RandomNickNames[44]=“海风”
+RandomNickNames[45]=“平板”
+RandomNickNames[46]=“粉碎”
+RandomNickNames[47]=“喷火战斗机”
+RandomNickNames[48]=“烟熏”
+RandomNickNames[49]=“沼泽物”
+RandomNickNames[50]=“T骨”
+RandomNickNames[51]=“霸王龙”
+RandomNickNames[52]=“坦克”
+RandomNickNames[53]=“重击”
+RandomNickNames[54]=“雷霆”
+RandomNickNames[55]=“挠痒痒”
+RandomNickNames[56]=“痛苦”
+RandomNickNames[57]=“泰坦”
+RandomNickNames[58]=“炸药”
+RandomNickNames[59]=“火炬”
+RandomNickNames[60]=“战犬”
+RandomNickNames[61]=“战马”
+RandomNickNames[62]=“野孩子”
;nicknames male only
+RandomNicknames_Male[0]=“金刚”
+RandomNickNames_Male[1]=“鲸鱼”
+RandomNicknames_Male[2]=“布法罗”
+RandomNickNames_Male[3]=“大象”
+RandomNickNames_Male[4]=“绿巨人”
+RandomNickNames_Male[5]=“柯南”
+RandomNickNames_Male[6]=“The Thing”
+RandomNickNames_Male[7]=“歌利亚”
;nicknames female only
+RandomNickNames_Female[0]=“”
+RandomNicknames_Female[1]=“壳牌”
+RandomNickNames_Female[2]=“堡垒”
+RandomNicknames_Female[3]=“城堡”
+RandomNickNames_Female[4]=“泰坦尼克号”
+RandomNickNames_Female[5]=“熊妈妈”
+RandomNickNames_Female[6]=“深六”
+RandomNickNames_Female[7]=“萤火虫”
;photobooth male
+PhotoboothSoloBLines_Male[0]=“附近友好的巨人！
+PhotoboothSoloBLines_Male[1]=“真正的英雄没有痛苦！
+PhotoboothSoloBLines_Male[2]=“他的坦克小精灵救了人命！
+PhotoboothSoloBLines_Male[3]=“疲惫不堪，四面楚歌！
+PhotoboothSoloBLines_Male[4]=“幸存者。牧羊人。
;photobooth female
+PhotoboothSoloBLines_Female[0]=“附近友好的女巨人！
+PhotoboothSoloBLines_Female[1]=“真正的海洛因没有痛苦！
+PhotoboothSoloBLines_Female[2]=“她的坦克小精灵救了人命！
+PhotoboothSoloBLines_Female[3]=“疲惫不堪，四面楚歌！
+PhotoboothSoloBLines_Female[4]=“生存主义者。保护女。

; Xcom Archiv
[WOTCTank X2EncyclopediaTemplate]
+ListTitle="坦克"
+DescriptionTitle="坦克"
+DescriptionEntry="We do not know exactly what the task of our tank soldiers was in the beginning of the war. Rumor has it, our first tank units were formed in the end of the alien invasion to offset the big loss of the new developed hope bringing MEC soldiers. Thus we believe, that from these events our today`s tank training route has arisen from. Unfortunately this was never confirmed and it is still uncertain till this day what exactly their task to win the war over had been.<br/> <br/>As we abstract from founded paper scraps and barely legible documents, combat teams including tank units were connected with catchphrases like defense lines, holding back tactics, area protection, personal-, transport- and escort security. Apparently tanks were send along where it was necessary to start distraction tactics, to stand long firefights, to confront many enemies at a single blow, to protect something or to simple play out time.<br/> <br/>Just a few rebels compete voluntarily for the tank military service and only the most resilient contenders will be choosen as tank soldiers in the course of recruitment process. However since the news have been spread out that the commander personally is on the look-out for capable tanks, we measured a significant intake increase.<br/> <br/>One of the coretasks of tank units consists of arouse hostile attention and clear the way for squadmates. They also bring along many protective skills and can train their chance of survival as well as learn counterattack tactics. Because they play a more active role in tactical combat, it can happen that a tank soldier will suddenly find himself behind enemy lines, what makes tanks to a more considered choise for timed missions.<br/> <br/>They carry mostly an assault rifle as primary weapon, but they are also trained in handling other weapons and have enough strength to bring heavy canons to battles like our gunners. Because our tank soldiers on the basis of their unique combat style succumb not only high casualty rates but also expose outstanding wound dangers, they never go into a fight without their protective gear, a side development of our first drone prototypes.<br/> <br/>C. O. BRADFORD [NOTE]: Although recruits of the tank class exhibit a good general condition and can interact with many weapons, I ask myself how long they can stay in a fight, if they hardly hit their enemies...at the shooting gallery tanks have always the worst results.<br/>"

[WOTCTankTanklin X2EncyclopediaTemplate]
+ListTitle="坦克小精灵"
+DescriptionTitle="坦克小精灵"
+DescriptionEntry="The cousin of our popular GREMLIN drones, is by our units mockingly called 坦克小精灵, but this little tough invention has already saved many a lifes from our resistance fighters. It has a better plating than our standard drones and also a more powerful core, but the AI is not as smart as other drones. As the 坦克小精灵 fulfills all technical requirements for a remote hack, this makes our tanks a good second choise, if our specialists are not avaiable."

; *********************************************************************************************************************
; ***                                         WOTC TANK ABILITIES                                                   ***
; *********************************************************************************************************************

; GTS
[TankWOTCResilience X2AbilityTemplate]
+LocFriendlyName="回弹"
+LocHelpText="敌人攻击坦克将受到-50点的暴击惩罚."
+LocFlyOverText="回弹"

[TankWOTCResilienceUnlock X2SoldierAbilityUnlockTemplate]
+DisplayName="坦克：回弹"
+Summary="特殊的战斗训练揭示了我们坦克的弱点。现在我们可以利用它们来发挥我们的优势.<br/><Bullet/> 敌人攻击坦克时受到暴击率-50的惩罚.<br/>"

[TankWOTCHackSeminar X2AbilityTemplate]
+LocFriendlyName="黑客研讨"
+LocHelpText="这名士兵获得+30侵入."
+LocFlyOverText="黑客研讨"

[TankWOTCHackSeminarUnlock X2SoldierAbilityUnlockTemplate]
+DisplayName="坦克：黑客研讨"
+Summary="Our best specialists will teach our tanks to become more effective against the advent network.<br/><Bullet/> Will increase the hack stats of our tanks by +30.<br/>"

; ---------- General Path -----------------

; Squaddie
[TankWOTCHereIAm X2AbilityTemplate]
+LocFriendlyName="我在这儿"
+LocLongDescription="尝试将这名士兵变成主要目标。对其的攻击获得+70%命中率和-20暴击率，持续一个回合。警告：可能会必中。"
+LocHelpText="尝试将这名士兵变成主要目标。所有单位攻击他时获得+70%命中率，但暴击率减少20." 
+LocFlyOverText="我在这儿"
+LocPromotionPopupText="<Bullet/>攻击这名士兵时的命中率增加70%.<br/><Bullet/>对这名士兵的攻击受到-20%暴击率的惩罚。<br/><Bullet/> 3回合冷却。“我在这儿”在玩家回合开始时结束。不消耗行动点数。<br/><Bullet/>请确保敌人能够看见你。<br/><Bullet/>因为额外的命中率，该士兵很可能必定被击中。<br/><Bullet/>这些增益和惩罚可以和其它技能叠加，比如弹性。<br/><Bullet/>敌人可能更喜欢攻击被标记或夹击的单位，即使这名士兵更容易被击中<br/><Bullet/>会解除隐身。<br/>"

[TankWOTCProtectionProtocolAblative X2AbilityTemplate]
+LocFriendlyName="保护协议"
+LocLongDescription="命令您的坦克小精灵激活保护协议.它将赋予目标不同的防御加成."
+LocHelpText="命令您的坦克小精灵激活保护协议."
+LocFlyOverText="保护协议"
+LocPromotionPopupText="<Bullet/> PROTECTION PROTOCOL if used with your first action, will not end your turn.<br/><Bullet/> PROTECTION PROTOCOL has a 3 turn cooldown and uses one action.<br/><Bullet/> PROTECTION PROTOCOL lasts to the start of your next turn.<br/><Bullet/> PROTECTION PROTOCOL bonuses: +2 ablative HP, +10 dodge, +1 melee damage reduction, +1 explosive damage reduction.<br/><Bullet/> The damage reduction can not lead to 0 damage.<br/><Bullet/> PROTECTION PROTOCOL bonuses can become stronger with more advanced 坦克小精灵s.<br/><Bullet/> PROTECTION PROTOCOL can also be used if this soldier is burning, disoriented or suppressed.<br/><Bullet/> PROTECTION PROTOCOL does not break concealment.<br/>"

; ---------- Survival Tank ------------------

; Lance Corporal
[TankWOTCSteadfast X2AbilityTemplate]
+LocFriendlyName="坚定"
+LocLongDescription="永远不会因为受伤，或队友死亡而惊慌。也免疫昏迷。"
+LocFlyOverText="坚定"
+LocPromotionPopupText="<Bullet/>不免疫失去意识或混乱。<br/><Bullet/>惊慌免疫对灵能攻击无效，但是对另一些罕见的攻击有效。<br/><Bullet/>免疫昏迷。<br/>"
+LocPromotionPopupText="<Bullet/> Not immune to unconscious and disorientation.<br/><Bullet/> The panic immunity will not work on psi attacks, but on some other rare attacks.<br/><Bullet/> Immunity against stun.<br/>"

; Corporal
[TankWOTCSuspension X2AbilityTemplate]
+LocFriendlyName="悬吊"
+LocHelpText="减少受到的反应射击造成的伤害 +"
+LocLongDescription="减少受到的反应射击造成的伤害."
+LocPromotionPopupText="<Bullet/> Works for all reaction attacks, like overwatch shots and other reaction abilities.<br/><Bullet/> The damage reduction bonus depends on the equipped armor technology.<br/><Bullet/> Damage reduction bonus: +1 conventional, +2 plated, +3 powered.<br/><Bullet/> The damage reduction bonus can stack with other abilities.<br/><Bullet/> The damage reduction can not lead to 0 damage.<br/>"

; Staff Sergeant
[TankWOTCShockAbsorbantArmor X2AbilityTemplate]
+LocFriendlyName="减震装甲"
+LocLongDescription="减少 2 格半径内的伤害."
+LocHelpText="减少 2 格半径内的伤害 +"
+LocFlyOverText="减震装甲"
+LocPromotionPopupText="<Bullet/> Damage from grenades and other indirect attacks is calculated from the point of the explosion.<br/><Bullet/> The damage reduction bonus depends on the equipped armor technology.<br/><Bullet/> Damage reduction bonus: +1 conventional, +2 plated, +3 powered.<br/><Bullet/> The damage reduction bonus can stack with other abilities.<br/><Bullet/> The damage reduction bonus is not granted to allies.<br/><Bullet/> The damage reduction can not lead to 0 damage.<br/>"

; Tech Sergeant
[TankWOTCSurvivalTraining X2AbilityTemplate]
+LocFriendlyName="生存训练"
+LocLongDescription="蹲下立即治疗+5点生命值，火，酸，毒。还显著缩短了该装置的伤口恢复时间."
+LocHelpText="治疗并趴下。"
+LocFlyOverText="生存训练"
+LocPromotionPopupText="<Bullet/> 1 use per mission.<br/><Bullet/> Can only be activated in cover.<br/><Bullet/> Heal immediatly +5 HP, fire, acid and poison.<br/><Bullet/> Receive the normal HUNKER DOWN Ability bonuses once in the activating turn.<br/><Bullet/> Reduces wound recovery time for this unit significantly, but only if SURVIVAL TRAINING was activated in the mission.<br/>"

[TankWOTCSurvivalTrainingHunkerDown X2AbilityTemplate]
+LocFriendlyName="生存训练"
+LocHelpText="+50闪避，并且+ 30防御，直到你的下一个回合。"
+LocFlyOverText="趴下。"

; Gunnery Sergeant
[TankWOTCAbsorptionField X2AbilityTemplate]
+LocFriendlyName="吸收场"
+LocHelpText="该单位有减少伤害加成：+"
+LocLongDescription="该单位被一个伤害吸收场包围，该场立即降低单位本身和场内任何盟友的伤害."
+LocPromotionPopupText="<Bullet/> The armor generates a special damage absorbing field around the unit.<br/><Bullet/> 2 tile radius.<br/><Bullet/> The strength of the field depends on the unit's equipped armor technology.<br/><Bullet/> Damage reduction bonuses: +1 conventional, +2 plated, +3 powered;<br/><Bullet/> Because overlayed absorption fields are becoming stronger, a unit inside multiple absorption fields receives stacked damage reduction and these bonuses can again stack with other abilities.<br/><Bullet/> The damage reduction can not lead to 0 damage.<br/>"

[TankWOTCAbsorptionFieldPassiveInfo X2AbilityTemplate]
+LocFriendlyName="吸收场"
+LocLongDescription="该单位被一个伤害吸收场包围，可以立即降低单位本身和场内任何盟友的伤害."

; ---------- Middle ------------------

; Lance Corporal
[TankWOTCBallisticVests X2AbilityTemplate]
+LocFriendlyName="防弹背心"
+LocLongDescription="这名士兵每装备一件背心或镀层，就会获得+1点额外的护甲."
+LocHelpText="这名士兵每装备一件背心或镀层，就会获得+1点额外的护甲."
+LocFlyOverText="防弹背心"
+LocPromotionPopupText="<Bullet/> BALLISTIC VESTS adds for each equipped vest or plating 1 point of armor to this soldier.<br/><Bullet/> Bonuses will be applied on start of the mission.<br/>"

[TankWOTCBallisticVestsPassiveInfo X2AbilityTemplate]
+LocFriendlyName="防弹背心"
+LocLongDescription="这名士兵每装备一件背心或镀层，就会获得+1点额外的护甲."

; Corporal
[TankWOTCWarningShot X2AbilityTemplate]
+LocFriendlyName="警告射击"
+LocLongDescription="一个特殊的射击，有很高几率使目标惊慌，无论是否命中。但是即使命中，也只会擦伤目标。"
+LocHelpText="一次可以使目标惊慌的射击。击中时至多只能擦伤。"
+LocFlyOverText="警告射击"
+LocPromotionPopupText="<Bullet/>用你的主武器进行一次特殊的射击，使目标惊慌，无论攻击命中与否。<br/><Bullet/>如果攻击命中，目标有80%的几率被惊慌，但是子弹只会擦伤目标，与目标的闪避无关。<br/><Bullet/>如果攻击未命中，有60%的几率使目标惊慌。<br/><Bullet/>消耗1个行动点，并且结束士兵的回合。<br/><Bullet/>使用1发弹药，有4回合冷却。<br/><Bullet/>可以使用小队视野，但目标必须在武器射程之内。<br/><Bullet/>一些稀有敌人会免疫精神攻击或惊慌。<br/><Bullet/>会破除隐身。<br/>"

; Tech Sergeant
[TankWOTCDecoy X2AbilityTemplate]
+LocFriendlyName="诱饵"
+LocLongDescription="在你的物品栏中提供一个免费的拟态信标。"
+LocHelpText="在你的物品栏中提供一个免费的拟态信标。"
+LocFlyOverText="诱饵"
+LocPromotionPopupText="<Bullet/>拟态信标生成一个全息诱饵，吸引敌人攻击，持续一个回合。<br/><Bullet/>它的使用就像手榴弹，扔到一个地点，诱饵在彼处出现。<br/><Bullet/>拟态信标持续一个回合，或者直到他们的生命值因敌人攻击而耗尽。<br/><Bullet/>使用后破除隐身。<br/><Bullet/>一些稀有敌人对拟态信标免疫。<br/><Bullet/>每个任务限一次。<br/>"

[TankWOTCDecoyPassiveInfo X2AbilityTemplate]
+LocFriendlyName="诱饵"
+LocLongDescription="这个士兵获得了1个免费的拟态信标。"
+LocFlyOverText="诱饵"

; Gunnery Sergeant
[TankWOTCTeamShield X2AbilityTemplate]
+LocFriendlyName="团队护盾"
+LocLongDescription="激活效果能量护盾区域。它赋予该单位和队友护盾."
+LocHelpText="激活一个团队护盾。" 
+LocFlyOverText="团队护盾"
+LocPromotionPopupText="<Bullet/> TEAM SHIELD activation will end the soldiers turn.<br/><Bullet/> 1 Charge per Mission.<br/><Bullet/> TEAM SHIELD lasts for 5 turns until the ablative HPs are depleted. They will also be removed from your squadmates if this soldier dies.<br/><Bullet/> 10 tiles radius.<br/><Bullet/> The amount of granted ablative HPs depends on the activators equipped primary weapon technology: +2 conventional, +3 laser/pulse, +4 magnetic, +5 coil, +6 beam.<br/><Bullet/> Does break concealment.<br/>"

; Master Sergeant
[TankWOTCEverSafe X2AbilityTemplate]
+LocFriendlyName="永安"
+LocLongDescription="如果你所有的行动点数都用于移动，在回合结束时你会自动激活保护协议。"
+LocHelpText="自动激活保护协议，如果你这一回合除了移动以外啥也没做。"
+LocFlyOverText="保护协议：永安"
+LocPromotionPopupText="<Bullet/>永安为坦克提供了一个非常高机动性的玩法。<br/><Bullet/>除了移动以外，任何操作都会使之失效。<br/><Bullet/>如果你这回合压根啥也没做，永安也会生效。<br/><Bullet/>惊慌时不会生效。<br/>"

[TankWOTCEverSafePassiveInfo X2AbilityTemplate]
+LocFriendlyName="永安"
+LocLongDescription="如果你所有的行动点数都用于移动，在回合结束时你会自动激活保护协议。"
+LocHelpText="自动激活保护协议，如果你这一回合除了移动以外啥也没做。"
+LocFlyOverText="保护协议：永安"

; ---------- Battle Tank ------------------

; Lance Corporal
[TankWOTCChallenge X2AbilityTemplate]
+LocFriendlyName="挑战"
+LocLongDescription="挑战敌人，将其作为你的主要敌人。使用这个能力的士兵在攻击被挑战的敌人时获得增益。使用这个能力的士兵激励周围的友军，如果被挑战的敌人被杀死。"
+LocHelpText="挑战这个敌人2回合。"
+LocFlyOverText="挑战"
+LocPromotionPopupText="<Bullet/>挑战一个目标2回合。<br/><Bullet/>消耗1个行动点。4回合冷却。<br/><Bullet/>每个拥有挑战技能的士兵，在攻击被挑战的单位时，都获得+15命中和+10暴击增益。<br/><Bullet/>破除隐身。<br/><Bullet/>当一个拥有挑战技能的士兵杀死一个被挑战的目标，周围的友军（半径7格）会被激励，提高+1移动力，+10%命中，+5%暴击，+5闪避，+5防御，+20意志力，持续2回合。<br/>"

[TankWOTCChallengeAim X2AbilityTemplate]
+LocFriendlyName="挑战"
+LocLongDescription="这名士兵在攻击被挑战的敌人时获得增益。+15%命中和+10%暴击。当这名士兵杀死一个被挑战的敌人，他会暂时激励周围的友军。"

[TankWOTCChallengeMotivation X2AbilityTemplate]
+LocFriendlyName="激励"
+LocFlyOverText="被激励"
+LocHelpText="这个单位被激励，因为一个被挑战的敌人被杀死了。奖励：+1移动力，+10%命中，+5%暴击，+5闪避，+5防御，+20意志力，持续2回合。"

; Corporal
[TankWOTCRevenge X2AbilityTemplate]
+LocFriendlyName="复仇"
+LocHelpText="当被敌人作为攻击目标时，自动用你的主武器反击，每回合限一次。"
+LocLongDescription="当被敌人作为攻击目标时，自动用你的主武器反击，每回合限一次。"
+LocPromotionPopupText="<Bullet/> REVENGE can only trigger once per turn.<br/><Bullet/> REVENGE can be triggered by melee attacks and Area of Effect attacks.<br/><Bullet/> REVENGE will not trigger when targeted by overwatch fire.<br/><Bullet/> REVENGE will only work against targets in your weapon range, sight range and as long the soldier has ammo left.<br/><Bullet/> REVENGE does not work if this soldier is burning and on some rare enemy psi attacks.<br/><Bullet/> REVENGE will not work on squadmates if this unit is mind controlled.<br/><Bullet/> REVENGE will not work on enemies who are taking peeking shots or on enemies with the SHADOWSTEP ability.<br/><Bullet/> If the hit chance is below 1%, REVENGE will not trigger. This can also be controlled with FIRE CONTROL PCS.<br/><Bullet/> REVENGE can combine with other reaction shots.<br/><Bullet/> Because it is a reaction shot, it may can crit in combination with other abilities.<br/>"

[TankWOTCRevengeShot X2AbilityTemplate]
+LocFriendlyName="复仇"
+LocHelpText="当被敌人作为攻击目标时，自动用你的主武器反击，每回合限一次。"

[TankWOTCAttitude X2AbilityTemplate]
+LocFriendlyName="态度"
+LocFlyOverText="态度：改变"
+LocHelpText="改变单位的态度."
+LocLongDescription="该单位将不再激活惩罚或预射在接下来的 5 回合。单位暂时获得+5闪避作为交换."

; Sergeant
[TankWOTCPreFire X2AbilityTemplate]
+LocFriendlyName="提前开火"
+LocHelpText="当被敌人作为攻击目标时，自动用你的主武器进行一次优先的反应射击，每回合限一次。"
+LocLongDescription="当被敌人作为攻击目标时，自动用你的主武器进行一次优先的反应射击，每回合限一次。"
+LocPromotionPopupText="<Bullet/> PRE FIRE can only trigger once per turn.<br/><Bullet/> PRE FIRE can be triggered by melee attacks and Area of Effect attacks.<br/><Bullet/> PRE FIRE will not trigger when targeted by overwatch fire.<br/><Bullet/> PRE FIRE will only work against targets in your weapon range, sight range and as long the soldier has ammo left.<br/><Bullet/> PRE FIRE does not work if this soldier is burning and on some rare enemy psi attacks.<br/><Bullet/> PRE FIRE will not work on squadmates if this unit is mind controlled.<br/><Bullet/> PRE FIRE will not work on enemies who are taking peeking shots or on enemies with the SHADOWSTEP ability.<br/><Bullet/> If the hit chance is below 1%, PREFIRE will not trigger. This can also be controlled with FIRE CONTROL PCS.<br/><Bullet/> PRE FIRE can combine with other reaction shots.<br/><Bullet/> Because it is a reaction shot, it may can crit in combination with other abilities.<br/>"

[TankWOTCPreFireShot X2AbilityTemplate]
+LocFriendlyName="提前开火"
+LocHelpText="当被敌人作为攻击目标时，自动用你的主武器进行一次优先的反应射击，每回合限一次。"

; Staff Sergeant
[TankWOTCStandBy X2AbilityTemplate]
+LocFriendlyName="准备就绪"
+LocFlyOverText="准备就绪"
+LocLongDescription="这名士兵的所有反应射击都可以暴击。这个单位的反应射击和其它反击技能还拥有+10%命中，+10%暴击和+1额外基础伤害。"
+LocPromotionPopupText="<Bullet/>这名士兵的可以在反应射击时暴击了。<br/><Bullet/>这名士兵的反应射击和其它反击有+10%命中和+10%暴击几率。<br/><Bullet/>这名士兵的反应射击和其它反击造成1点额外的基础伤害。<br/><Bullet/>准备就绪的增益可与其它技能叠加。<br/>"

; Tech Sergeant
[TankWOTCCombatDrugs X2AbilityTemplate]
+LocFriendlyName="战斗药物"
+LocLongDescription="在你的物品栏中提供一个免费的超能血清。"
+LocHelpText="在你的物品栏中提供一个免费的超能血清。"
+LocFlyOverText="战斗药物"
+LocPromotionPopupText="<Bullet/>一个使用了超能血清的士兵，在接下来的2回合里获得额外的移动力和护甲。<br/><Bullet/>超能血清也使士兵暂时免疫昏迷和几乎所有灵能攻击。<br/><Bullet/>激活超能血清是不消耗行动点，也不解除隐身。<br/><Bullet/>超能血清的增益不会叠加，如果你在一回合中使用了两个。<br/><Bullet/>每场任务限一次。<br/>"

[TankWOTCCombatDrugsPassiveInfo X2AbilityTemplate]
+LocFriendlyName="战斗药物"
+LocLongDescription="这个士兵获得了1个免费的超能血清。"
+LocFlyOverText="战斗药物"

[TankWOTCCombatStims X2AbilityTemplate]
+LocFriendlyName="战斗药物：超能血清"
+LocLongDescription="一个使用了超能血清的士兵，在接下来的2回合里获得额外的移动力，昏迷免疫，免疫几乎所有灵能攻击，额外护甲，持续2回合。激活它不消耗行动点。"
+LocHelpText="获得额外的移动力，昏迷免疫，免疫几乎所有灵能攻击，额外护甲，持续2回合。激活它不消耗任何行动点。"
+LocFlyOverText="战斗药物：超能血清"

; Gunnery Sergeant
[TankWOTCReflectionField X2AbilityTemplate]
+LocFriendlyName="反射场"
+LocLongDescription="该单元被反射场包围。任何来自射击的伤害都有 33% 的几率被反射而不是击中单位。"
+LocFlyOverText="反射场"
+LocPromotionPopupText="<Bullet/> 反射的射击将击中攻击者而不是单位.<br/><Bullet/> Does not work for reaction attacks, like overwatch shots.<br/><Bullet/> Does not work for AOE attacks, like grenades.<br/><Bullet/> Does not work for attacks with special damage types, like psi attacks.<br/><Bullet/> Does not work for melee attacks.<br/>"

; *********************************************************************************************************************
; ***                                         TANKLIN                                                               ***
; *********************************************************************************************************************

; ---------- Tanklin Abilities --------------

[TankWOTCShieldHit X2AbilityTemplate]
+LocFriendlyName="自卫上行链路"
+LocLongDescription="坦克可以免费对进入近战范围或从近战范围攻击的敌人进行近战攻击，只要保护协议处于活动状态."
+LocFlyOverText="自卫上行链路"

[TankWOTCShieldHitRangeAttack X2AbilityTemplate]
+LocFriendlyName="自卫上行链路"
+LocFlyOverText="自卫上行链路"

[TankWOTCAdvancedStorage X2AbilityTemplate]
+LocFriendlyName="高级存储"
+LocLongDescription="您也可以在其他设备上使用保护协议."

[TankWOTCLastChanceAbility X2AbilityTemplate]
+LocFriendlyName="纳米稳定剂"
+LocLongDescription="每个任务一次，如果坦克受到致命伤害，坦克不会死亡，而是立即激活保护协议并将单位治疗到 5 点生命值."
+LocFlyOverText="纳米稳定剂：保护协议"

[TankWOTCLastChanceTriggeredAbility X2AbilityTemplate]
+LocFriendlyName="纳米稳定剂"
+LocLongDescription="这个士兵本该死亡，却活了下来并激活了保护协议。这次任务不会再发生这种事了。"
+LocHelpText="这个士兵本该死亡，却活了下来并激活了保护协议。这次任务不会再发生这种事了。"
+LocFlyOverText="纳米稳定剂: 保护协议"

; ---------- Tanklin Drone ------------------

[Tanklin_CV X2GremlinTemplate]
+FriendlyName="坦克小精灵"
+FriendlyNamePlural="坦克小精灵"
+BriefSummary="坦克小精灵是一架坚固的无人机."
+TacticalText="<Bullet/> 坦克小精灵允许坦克执行各种战场任务和特殊能力.\n<Bullet/> The 坦克小精灵 is generally unnoticed by enemies, and can not take damage or be destroyed. It will shut down if its owner is incapacitated or killed."
+AbilityDescName="坦克小精灵"

[Tanklin_MG X2GremlinTemplate]
+FriendlyName="坦克小精灵 Mark II"
+FriendlyNamePlural="坦克小精灵S Mark II"
+BriefSummary="坦克小精灵 Mark II是标准坦克小精灵无人机的改进版本."
+TacticalText="<Bullet/> 保护协议堆叠加成:\n 护盾： +2， 闪避： +10， 近战伤害降低： +1， 爆炸伤害减少: +1;\n<Bullet/> The 坦克小精灵 Mk II allows Tanks to execute a variety of battlefield tasks and special abilities."
+AbilityDescName="坦克小精灵 Mark II"

[Tanklin_BM X2GremlinTemplate]
+FriendlyName="坦克小精灵 Mark III"
+FriendlyNamePlural="坦克小精灵 Mark III"
+BriefSummary="坦克小精灵 Mark III是标准坦克小精灵无人机的改进版本s."
+TacticalText="<Bullet/> 保护协议堆叠加成:\n 护盾： +3， 闪避： +15， 近战伤害降低： +2， 爆炸伤害减少: +2;\n<Bullet/> The 坦克小精灵 Mk III allows Tanks to execute a variety of battlefield tasks and special abilities."
+AbilityDescName="坦克小精灵 Mark III"

[Tanklin_MG_Schematic X2SchematicTemplate]
+m_strClassLabel="坦克"

[Tanklin_BM_Schematic X2SchematicTemplate]
+m_strClassLabel="坦克"
